{"3c2336d":"About","-110fda45":"Research","1fa3c2":"Blog","4b0c1ae4":"Podcast","-25922fb7":"Conferences ","3d503d2b":"No items found.","7f2746de":"Contact Us","523998cf":"Support Us","-7c305781":"Founded in 2011, the Islam & Liberty Network is a global platform dedicated to demonstrating the compatibility of Islam with religious, economic, and political freedoms. Our mission is to foster understanding, promote peaceful dialogue, and empower communities to build prosperous, free societies grounded in universal values. Our work spans conferences, publications, and educational programs across Muslim-majority countries.","-52bd880f":"Learn More","a8fda9a":"From Our Podcast","5dd7d837":"Tune in to our latest podcast episodes exploring the intersection of Islam, liberty and prosperity. Our thought leaders dive into topics like political, economic and religious freedoms, offering fresh perspectives. ","-22373eb6":"Click here to listen now","2e":".","-29bb2ee0":"Our Latest Research","2a5972fc":"Join the conversation for freedom in the Muslim world — explore our latest papers and insights today. ","-3e47c327":"Click here to read now","-3ff31034":"From Our Blog","-5d261279":"Stay informed with our latest insights on freedom and prosperity in Muslim societies through our blog. From reflections on our recent events to thought-provoking articles on Islamic governance, we share ideas that matter. To read more, ","-31cbd078":"click here","7bbe5a25":"Endorsements","225473aa":"Office Address:","974a2e9":"Islam & Liberty Network (L) Foundation (Registration No. LAF 00194)","3bd7e867":"The Lower Penthouse, Wisma Hangsam 1, Jalan Hang Lekir","-144e7483":"Kuala Lumpur","-3fb8bafa":"Malaysia, 50000","-faf15aa":"Email Address: ","36aa7c48":"info@islamandlibertynetwork.org","8531b3f":"Our Partners","-58112d":"Copyright © 2010- 2022 Islam and Liberty Network. All Rights Reserved. Built with ❤️ and 🤲 by","-38aafe22":" Adnan Abbasi","-59d8df42":"Sponsored by","579a34bd":"Sessions","-7b55b5d0":"To watch the full conference playlist, click this button.","-7b61fb8c":"Speakers","3e0e6a5":"Chair","-3a25c005":"Who We Are?","-5526054d":"Islam and Liberty Network (L) Foundation is legally organised as a non-profit Labuan foundation registered in Malaysia and is governed by an international board of directors, all of whom except for the part-time CEO give their time freely. Founded in 2011, it is a platform for researchers, academics and public intellectuals to explore and promote a Muslim case for religious, economic and political freedom by disseminating knowledge and developing human resources. We are funded by like minded foundations and individuals.","-a08394":"Mission and Theme","48aa9787":"The Islam & Liberty Network exists to explore and promote a Muslim case for freedom. We consider the words freedom and liberty to be interchangeable.","7740d724":"By freedom, we mean:","486ef0e":"1. Religious freedom","18dac82f":"2. Political freedom","742b7d70":"3. Economic freedom","-3ca1b8b":"Our mission is to apply serious intellectual efforts to demonstrate that Islam and a free society are compatible. Poor quality thinking can only be changed by better thinking. We promote change with our annual programme which includes an international conference, a regional residential workshop, opinion articles, and podcasts.","-2b08d683":"ILN Journey Through Time","-71b8e151":"People"}